In [9]:
import pandas as pd
import numpy as np
import matplotlib as mp
from sklearn.preprocessing import LabelEncoder
dataset=pd.read_csv(r"C:\Users\ML Lab\Desktop\22CSELE05\Bdata.csv")
labelencoder = LabelEncoder()
dataset['purchase'] = labelencoder.fit_transform(dataset['Purchased'])
dataset

    Unnamed: 0 Country   AGE    Salary Purchased  purchase
0            0  France  44.0   10000.0       YES         1
1            1   Spain  27.0   20000.0       YES         1
2            2  Gemany  30.0   23000.0        NO         0
3            3   Spain  38.0   35000.0       YES         1
4            4  Gemany  40.0       NaN        NO         0
5            5  France  35.0   38000.0        NO         0
6            6   Spain   NaN   56000.0       YES         1
7            7  France  48.0   44000.0       YES         1
8            8  Gemany  50.0  100000.0        NO         0
9            9  France  37.0  120000.0       YES         1
10          10     USA  45.0   90000.0       YES         1

In [16]:
import pandas as pd
countries = ["Germany","India","UK","Egypt","Iran"]
continents = ["Europe","Asia","Europe","Africa","Asia"]
code = ["G","I","U","E","N"]
d={"country": countries, "continent":continents, "code":code}
df = pd.DataFrame(d)
df

   country continent code
0  Germany    Europe    G
1    India      Asia    I
2       UK    Europe    U
3    Egypt    Africa    E
4     Iran      Asia    N

In [17]:
df['code'] = df.code.astype('category')
df

   country continent code
0  Germany    Europe    G
1    India      Asia    I
2       UK    Europe    U
3    Egypt    Africa    E
4     Iran      Asia    N

In [18]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df["labeled_continent"] = le.fit_transform(df["continent"])
df

   country continent code  labeled_continent
0  Germany    Europe    G                  2
1    India      Asia    I                  1
2       UK    Europe    U                  2
3    Egypt    Africa    E                  0
4     Iran      Asia    N                  1

In [23]:
dataset.info

<bound method DataFrame.info of     Unnamed: 0 Country  Age     Salary Purchased
0            0  France  44.0   10000.0       YES
1            1   Spain  27.0   20000.0       YES
2            2  Gemany  30.0   23000.0        NO
3            3   Spain  38.0   35000.0       YES
4            4  Gemany  40.0       NaN        NO
5            5  France  35.0   38000.0        NO
6            6   Spain   NaN   56000.0       YES
7            7  France  48.0   44000.0       YES
8            8  Gemany  50.0  100000.0        NO
9            9  France  37.0  120000.0       YES
10          10     USA  45.0   90000.0       YES>

In [24]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  11 non-null     int64
 1   Country     11 non-null     object
 2   Age         10 non-null     float64
 3   Salary      10 non-null     float64
 4   Purchased   11 non-null     object
dtypes: float64(2), int64(1), object(2)
memory usage: 568.0+ bytes

In [53]:
x=dataset.iloc[:,0]
x

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
Name: Unnamed: 0, dtype: int64

In [51]:
y=dataset.iloc[:,2]
y

0     44.0
1     27.0
2     30.0
3     38.0
4     40.0
5     35.0
6      NaN
7     48.0
8     50.0
9     37.0
10    45.0
Name: AGE, dtype: float64

In [36]:
from sklearn.preprocessing import OneHotEncoder
dummy=pd.get_dummies(dataset['Country'])
dummy

    France  Gemany  Spain  USA
0        1       0      0    0
1        0       0      1    0
2        0       1      0    0
3        0       0      1    0
4        0       1      0    0
5        1       0      0    0
6        0       0      1    0
7        1       0      0    0
8        0       1      0    0
9        1       0      0    0
10       0       0      0    1

In [35]:
import pandas as pd
import numpy as np
import matplotlib as mp
from sklearn.preprocessing import LabelEncoder
dataset=pd.read_csv(r"C:\Users\ML Lab\Desktop\22CSELE05\Bdata.csv")
labelencoder = LabelEncoder()
dataset['country'] = labelencoder.fit_transform(dataset['Country'])
dataset.values

array([[0, 'France', 44.0, 10000.0, 'YES', 0],
       [1, 'Spain', 27.0, 20000.0, 'YES', 2],
       [2, 'Gemany', 30.0, 23000.0, 'NO', 1],
       [3, 'Spain', 38.0, 35000.0, 'YES', 2],
       [4, 'Gemany', 40.0, nan, 'NO', 1],
       [5, 'France', 35.0, 38000.0, 'NO', 0],
       [6, 'Spain', nan, 56000.0, 'YES', 2],
       [7, 'France', 48.0, 44000.0, 'YES', 0],
       [8, 'Gemany', 50.0, 100000.0, 'NO', 1],
       [9, 'France', 37.0, 120000.0, 'YES', 0],
       [10, 'USA', 45.0, 90000.0, 'YES', 3]], dtype=object)

In [47]:
from sklearn.preprocessing import OneHotEncoder
onehot=OneHotEncoder()
onehot.fit_transform(dataset.Country.values.reshape(-1,1)).toarray()

array([[1., 0., 0., 0.],
       [0., 0., 1., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 1., 0., 0.],
       [1., 0., 0., 0.],
       [0., 0., 1., 0.],
       [1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [1., 0., 0., 0.],
       [0., 0., 0., 1.]])

In [52]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y, test_size=0.2,random_state=0)
x_train

10    10
6      6
1      1
7      7
8      8
3      3
0      0
5      5
Name: Unnamed: 0, dtype: int64